Autodesk.Revit.UI.TaskDialog.Show
Shows the task dialog.
Returns:  The user's response to the task dialog.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when
the task dialog is shown out of main thread of Revit.
Since: 2011

Autodesk.Revit.UI.TaskDialog.CommonButtons
The push buttons displayed in the task dialog.
Remarks:
If no common button or CommandLink is added to the task dialog, the dialog will contain the Close common button by default.
Revit task dialogs are following these conventions for commit button usage:
Use a single Close button instead of a single OK button on informational messages.  Use a question at the end of the Main Instruction with a Yes/No combo (or Yes/No/Cancel) instead of OK/Cancel. This should work 99% of the time. For example: “Are you sure you want to overwrite the file?” and use Yes/No buttons.  Do not customize the button names unless there is a very good reason to do so. For example, “Are you sure you want to save the file?” would use Yes/No buttons and not Save/No or Save/Cancel.
Since: 2011

Autodesk.Revit.UI.TaskDialog.FooterText
FooterText is used in the footer area of the task dialog.
Since: 2011

Autodesk.Revit.UI.TaskDialog.VerificationText
VerificationText is used to label the verification checkbox.
Remarks:
If VerificationText is set, a checkbox with the text will be shown. You can get the response of checkbox by checking the return value of the WasVerificationChecked() method.
Since: 2011

Autodesk.Revit.UI.TaskDialog.MainContent
MainContent is the smaller text that appears just below the main instructions.
Remarks:
The Main Content is optional. It should be used to give further explanation to the user, such as how to correct the problem or work around the situation.
It displays in a smaller black font below the main instructions. Follow these guidelines:
Text should be clear and jargon free.  Main content should not simply restate the main instructions in a different way, they should contain additional information
that builds upon or reinforces the main instructions.  Main content should be written in sentence format (normal capitalization and punctuation).  Address the user directly as “you” when needed.
Since: 2011

Autodesk.Revit.UI.TaskDialog.Id
The Id of the task dialog.
Remarks:
Id is used as TaskDialogShowingEventArgs.DialogId for DialogBoxShowing events.
Since: 2011

Autodesk.Revit.UI.TaskDialog.MainInstruction
The large primary text that appears at the top of a task dialog.
Remarks:
It should concisely sum up the problem or situation that is causing the message to display. Follow these guidelines:
Every task dialog includes a main instruction.  Text should not exceed three lines.  Text should use plain language and be jargon free.  Main instructions should be written in sentence format – normal capitalization and punctuation.  Address the user directly as “you” when appropriate.  When presented with multiple command link options the standard final line for the main instructions should be,
"What do you want to do?”
Revit will automatically break lines to make the message fit well. "\n" also breaks down to the next line. For a paragraph break, use "\n\n".
Hyperlinks added to the main instructions will not be enabled when the dialog is shown on Vista.
Since: 2011

Autodesk.Revit.UI.TaskDialog.Title
Title of the task dialog.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:  Thrown when setting the value to null.
Throws Autodesk.Revit.Exceptions.ArgumentException:  Thrown when setting the value to an empty string or string contains newline characters.
Remarks:
Titles of task dialogs should be unique. Do not reuse the same title for multiple task dialogs.
Newline characters are not allowed in Title.
When the dialogs is shown, Revit will put “External Command Name –“ or “External Application –“ in the front of the value by default. Examples:
Plug-in Name – No Rooms to Calculate  Plug-in Name – Invalid Value for Length
You can suppress it by setting TitleAutoPrefix to false.
Titles should describe the nature of the problem or state the situation that currently exists.
The title tells the user why they are getting the message, not what they are supposed to do.
Since: 2011